simulations/icofoam_cases/3_branch_one_main_pair/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    main_inlet
    {
        type            zeroGradient;
    }
    main_outlet
    {
        type            fixedValue;
	value		uniform 0;
    }
    branch_inlet
    {
        type            zeroGradient;
    }
    branch_outlet
    {
        type            fixedValue;
	value		uniform 0;
    }
    wall
    {
        type            zeroGradient;
	     
    }
    surfaces
    {
        type            zeroGradient;
	     
    }
}

// ************************************************************************* //
